mlnn3014/GD32F470VE_OLED_Project/Bsp/Src/oled_bsp.c
#include "oled_bsp.h"

#include "driver_ssd1306.h"
#include "gd32f4xx.h"
#include "gd32f4xx_dma.h"
#include "gd32f4xx_gpio.h"
#include "gd32f4xx_i2c.h"
#include "oledfont.h"
#include "systick.h"
#include "usart_app.h"

#include <stdarg.h>
#include <stdio.h>
#include <string.h>

#define OLED_I2C_PERIPH       I2C0
#define OLED_I2C_CLOCK        RCU_I2C0
#define OLED_I2C_OWN_ADDRESS  0x72U
#define OLED_I2C_WRITE_ADDR   0x78U
#define OLED_I2C_DATA_ADDRESS ((uint32_t)&I2C_DATA(OLED_I2C_PERIPH))

#define OLED_GPIO_CLOCK       RCU_GPIOB
#define OLED_GPIO_PORT        GPIOB
#define OLED_SCL_PIN          GPIO_PIN_8
#define OLED_SDA_PIN          GPIO_PIN_9

#define OLED_DMA_PERIPH       DMA0
#define OLED_DMA_CLOCK        RCU_DMA0
#define OLED_DMA_CH           DMA_CH6
#define OLED_DMA_SUBPERI      DMA_SUBPERI1
#define OLED_DMA_IRQn         DMA0_Channel6_IRQn

#define OLED_PAGE_COUNT       (OLED_HEIGHT / 8U)
#define OLED_ALL_PAGES        ((uint8_t)((1U << OLED_PAGE_COUNT) - 1U))
#define OLED_I2C_WAIT_TIMEOUT 100000U
#define OLED_TX_BUF_SIZE      (1U + (OLED_WIDTH * OLED_PAGE_COUNT))
#define OLED_CMD_BUF_SIZE     7U
#define OLED_FONT_8           8U
#define OLED_FONT_16          16U
#define OLED_ASYNC_TIMEOUT_MS 50U

typedef enum {
    OLED_TX_IDLE = 0,
    OLED_TX_CMD,
    OLED_TX_DATA,
} oled_tx_phase_t;

static ssd1306_handle_t s_oled_handle;
static uint8_t s_oled_inited;
static uint8_t s_oled_tx_buf[OLED_TX_BUF_SIZE];
static uint8_t s_oled_cmd_buf[OLED_CMD_BUF_SIZE];
static volatile uint8_t s_dirty_pages;
static volatile uint8_t s_active_pages;
static volatile uint8_t s_oled_busy;
static volatile uint8_t s_oled_error;
static volatile oled_tx_phase_t s_tx_phase;
static uint8_t s_tx_start_page;
static uint8_t s_tx_end_page;

static uint8_t oled_wait_i2c_flag_set(uint32_t i2c_periph, i2c_flag_enum flag, uint32_t timeout)
{
    while (timeout-- != 0U) {
        if (SET == i2c_flag_get(i2c_periph, flag)) {
            return 1U;
        }
    }

    return 0U;
}

static uint8_t oled_wait_i2c_stop_clear(uint32_t i2c_periph, uint32_t timeout)
{
    while (timeout-- != 0U) {
        if (0U == (I2C_CTL0(i2c_periph) & I2C_CTL0_STOP)) {
            return 1U;
        }
    }

    return 0U;
}

static uint8_t oled_wait_dma_ftf(uint32_t timeout)
{
    while (timeout-- != 0U) {
        if (SET == dma_flag_get(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_FLAG_FTF)) {
            return 1U;
        }
    }

    return 0U;
}

static uint8_t oled_wait_i2c_tx_complete(uint32_t timeout)
{
    while (timeout-- != 0U) {
        if (SET == i2c_flag_get(OLED_I2C_PERIPH, I2C_FLAG_AERR)) {
            i2c_flag_clear(OLED_I2C_PERIPH, I2C_FLAG_AERR);
            return OLED_ERR;
        }

        if (SET == i2c_flag_get(OLED_I2C_PERIPH, I2C_FLAG_BTC)) {
            return OLED_OK;
        }
    }

    return OLED_TIMEOUT;
}

static uint8_t oled_wait_addsend_or_nack(uint32_t timeout)
{
    while (timeout-- != 0U) {
        if (SET == i2c_flag_get(OLED_I2C_PERIPH, I2C_FLAG_ADDSEND)) {
            return 1U;
        }

        if (SET == i2c_flag_get(OLED_I2C_PERIPH, I2C_FLAG_AERR)) {
            i2c_flag_clear(OLED_I2C_PERIPH, I2C_FLAG_AERR);
            return 0U;
        }
    }

    return 0U;
}

static void oled_dma_int_enable_all(void)
{
    dma_interrupt_enable(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_FTF);
    dma_interrupt_enable(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_TAE);
    dma_interrupt_enable(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_SDE);
    dma_interrupt_enable(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_FEE);
}

static void oled_dma_int_disable_all(void)
{
    dma_interrupt_disable(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_FTF);
    dma_interrupt_disable(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_TAE);
    dma_interrupt_disable(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_SDE);
    dma_interrupt_disable(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_FEE);
}

static void oled_dma_int_clear_all(void)
{
    dma_interrupt_flag_clear(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_FLAG_FTF);
    dma_interrupt_flag_clear(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_FLAG_TAE);
    dma_interrupt_flag_clear(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_FLAG_SDE);
    dma_interrupt_flag_clear(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_FLAG_FEE);
}

static void oled_i2c_bus_reset(void)
{
    uint8_t i;

    i2c_dma_config(OLED_I2C_PERIPH, I2C_DMA_OFF);
    dma_channel_disable(OLED_DMA_PERIPH, OLED_DMA_CH);

    gpio_mode_set(OLED_GPIO_PORT, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, OLED_SCL_PIN | OLED_SDA_PIN);
    gpio_output_options_set(OLED_GPIO_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, OLED_SCL_PIN | OLED_SDA_PIN);

    gpio_bit_set(OLED_GPIO_PORT, OLED_SCL_PIN | OLED_SDA_PIN);
    for (i = 0U; i < 9U; i++) {
        gpio_bit_reset(OLED_GPIO_PORT, OLED_SCL_PIN);
        gpio_bit_set(OLED_GPIO_PORT, OLED_SCL_PIN);
    }

    gpio_bit_set(OLED_GPIO_PORT, OLED_SCL_PIN);
    gpio_bit_reset(OLED_GPIO_PORT, OLED_SDA_PIN);
    gpio_bit_set(OLED_GPIO_PORT, OLED_SDA_PIN);

    gpio_af_set(OLED_GPIO_PORT, GPIO_AF_4, OLED_SDA_PIN | OLED_SCL_PIN);
    gpio_mode_set(OLED_GPIO_PORT, GPIO_MODE_AF, GPIO_PUPD_PULLUP, OLED_SDA_PIN | OLED_SCL_PIN);
    gpio_output_options_set(OLED_GPIO_PORT, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, OLED_SDA_PIN | OLED_SCL_PIN);

    i2c_deinit(OLED_I2C_PERIPH);
    i2c_clock_config(OLED_I2C_PERIPH, 400000U, I2C_DTCY_2);
    i2c_mode_addr_config(OLED_I2C_PERIPH, I2C_I2CMODE_ENABLE, I2C_ADDFORMAT_7BITS, OLED_I2C_OWN_ADDRESS);
    i2c_enable(OLED_I2C_PERIPH);
    i2c_ack_config(OLED_I2C_PERIPH, I2C_ACK_ENABLE);
}

static void oled_mark_pages(uint8_t top, uint8_t bottom)
{
    uint8_t page;
    uint8_t start_page;
    uint8_t end_page;

    if (top >= OLED_HEIGHT) {
        return;
    }
    if (bottom >= OLED_HEIGHT) {
        bottom = OLED_HEIGHT - 1U;
    }
    if (top > bottom) {
        return;
    }

    start_page = (uint8_t)(top / 8U);
    end_page = (uint8_t)(bottom / 8U);
    for (page = start_page; page <= end_page; page++) {
        s_dirty_pages |= (uint8_t)(1U << page);
    }
}

static void oled_mark_all_dirty(void)
{
    s_dirty_pages = OLED_ALL_PAGES;
}

static uint8_t oled_prepare_i2c(uint8_t addr)
{
    uint32_t timeout = 10000U;

    if (addr != OLED_I2C_WRITE_ADDR) {
        return OLED_ERR;
    }

    if (SET == i2c_flag_get(OLED_I2C_PERIPH, I2C_FLAG_I2CBSY)) {
        oled_i2c_bus_reset();
    }

    while ((SET == i2c_flag_get(OLED_I2C_PERIPH, I2C_FLAG_I2CBSY)) && (--timeout != 0U)) {
    }

