mlnn3014/GD32F470VE_OLED_Project/Bsp/Src/oled_bsp.c
    if (timeout == 0U) {
        oled_i2c_bus_reset();
        timeout = 10000U;
        while ((SET == i2c_flag_get(OLED_I2C_PERIPH, I2C_FLAG_I2CBSY)) && (--timeout != 0U)) {
        }
        if (timeout == 0U) {
            return OLED_TIMEOUT;
        }
    }

    i2c_start_on_bus(OLED_I2C_PERIPH);
    if (oled_wait_i2c_flag_set(OLED_I2C_PERIPH, I2C_FLAG_SBSEND, OLED_I2C_WAIT_TIMEOUT) == 0U) {
        oled_i2c_bus_reset();
        return OLED_TIMEOUT;
    }

    i2c_master_addressing(OLED_I2C_PERIPH, addr, I2C_TRANSMITTER);
    if (oled_wait_addsend_or_nack(OLED_I2C_WAIT_TIMEOUT) == 0U) {
        i2c_stop_on_bus(OLED_I2C_PERIPH);
        (void)oled_wait_i2c_stop_clear(OLED_I2C_PERIPH, OLED_I2C_WAIT_TIMEOUT / 10U);
        oled_i2c_bus_reset();
        return OLED_ERR;
    }

    i2c_flag_clear(OLED_I2C_PERIPH, I2C_FLAG_ADDSEND);
    if (oled_wait_i2c_flag_set(OLED_I2C_PERIPH, I2C_FLAG_TBE, OLED_I2C_WAIT_TIMEOUT) == 0U) {
        oled_i2c_bus_reset();
        return OLED_TIMEOUT;
    }

    return OLED_OK;
}

static void oled_stop_i2c_dma(void)
{
    oled_dma_int_disable_all();
    dma_channel_disable(OLED_DMA_PERIPH, OLED_DMA_CH);
    i2c_dma_config(OLED_I2C_PERIPH, I2C_DMA_OFF);
    i2c_dma_last_transfer_config(OLED_I2C_PERIPH, I2C_DMALST_OFF);
}

static void oled_tx_finish(void)
{
    oled_stop_i2c_dma();
    i2c_stop_on_bus(OLED_I2C_PERIPH);
}

static uint8_t oled_tx_finish_blocking(void)
{
    uint8_t res;

    oled_stop_i2c_dma();
    res = oled_wait_i2c_tx_complete(OLED_I2C_WAIT_TIMEOUT);
    i2c_stop_on_bus(OLED_I2C_PERIPH);

    if (oled_wait_i2c_stop_clear(OLED_I2C_PERIPH, OLED_I2C_WAIT_TIMEOUT) == 0U) {
        oled_i2c_bus_reset();
        return OLED_TIMEOUT;
    }

    if (res != OLED_OK) {
        oled_i2c_bus_reset();
    }

    return res;
}

static uint8_t oled_dma_start(uint8_t addr, uint8_t control, uint8_t *buf, uint16_t len, uint8_t irq)
{
    uint8_t res;

    if ((buf == NULL) || (len == 0U) || (len > (OLED_TX_BUF_SIZE - 1U))) {
        return OLED_ERR;
    }

    res = oled_prepare_i2c(addr);
    if (res != OLED_OK) {
        return res;
    }

    s_oled_tx_buf[0] = control;
    if (buf != &s_oled_tx_buf[1]) {
        (void)memcpy(&s_oled_tx_buf[1], buf, len);
    }

    dma_channel_disable(OLED_DMA_PERIPH, OLED_DMA_CH);
    dma_flag_clear(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_FLAG_FTF);
    dma_flag_clear(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_FLAG_TAE);
    dma_flag_clear(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_FLAG_SDE);
    dma_flag_clear(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_FLAG_FEE);
    oled_dma_int_clear_all();
    dma_memory_address_config(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_MEMORY_0, (uint32_t)s_oled_tx_buf);
    dma_transfer_number_config(OLED_DMA_PERIPH, OLED_DMA_CH, (uint32_t)len + 1U);
    i2c_dma_last_transfer_config(OLED_I2C_PERIPH, I2C_DMALST_ON);
    i2c_dma_config(OLED_I2C_PERIPH, I2C_DMA_ON);

    if (irq != 0U) {
        oled_dma_int_enable_all();
    } else {
        oled_dma_int_disable_all();
    }

    dma_channel_enable(OLED_DMA_PERIPH, OLED_DMA_CH);

    return OLED_OK;
}

static uint8_t oled_dma_write(uint8_t addr, uint8_t control, uint8_t *buf, uint16_t len)
{
    uint8_t res;

    if (s_oled_busy != 0U) {
        return OLED_BUSY;
    }

    res = oled_dma_start(addr, control, buf, len, 0U);
    if (res != OLED_OK) {
        return res;
    }

    if (oled_wait_dma_ftf(OLED_I2C_WAIT_TIMEOUT) == 0U) {
        oled_stop_i2c_dma();
        i2c_stop_on_bus(OLED_I2C_PERIPH);
        (void)oled_wait_i2c_stop_clear(OLED_I2C_PERIPH, OLED_I2C_WAIT_TIMEOUT / 10U);
        oled_i2c_bus_reset();
        return OLED_TIMEOUT;
    }

    dma_flag_clear(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_FLAG_FTF);
    return oled_tx_finish_blocking();
}

static uint8_t oled_iic_init(void)
{
    dma_single_data_parameter_struct dma_init_struct;

    rcu_periph_clock_enable(OLED_GPIO_CLOCK);
    rcu_periph_clock_enable(OLED_I2C_CLOCK);
    rcu_periph_clock_enable(OLED_DMA_CLOCK);

    gpio_af_set(OLED_GPIO_PORT, GPIO_AF_4, OLED_SDA_PIN | OLED_SCL_PIN);
    gpio_mode_set(OLED_GPIO_PORT, GPIO_MODE_AF, GPIO_PUPD_PULLUP, OLED_SDA_PIN | OLED_SCL_PIN);
    gpio_output_options_set(OLED_GPIO_PORT, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, OLED_SDA_PIN | OLED_SCL_PIN);

    i2c_deinit(OLED_I2C_PERIPH);
    i2c_clock_config(OLED_I2C_PERIPH, 400000U, I2C_DTCY_2);
    i2c_mode_addr_config(OLED_I2C_PERIPH, I2C_I2CMODE_ENABLE, I2C_ADDFORMAT_7BITS, OLED_I2C_OWN_ADDRESS);
    i2c_enable(OLED_I2C_PERIPH);
    i2c_ack_config(OLED_I2C_PERIPH, I2C_ACK_ENABLE);

    dma_deinit(OLED_DMA_PERIPH, OLED_DMA_CH);
    dma_single_data_para_struct_init(&dma_init_struct);
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPH;
    dma_init_struct.memory0_addr = (uint32_t)s_oled_tx_buf;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
    dma_init_struct.periph_addr = OLED_I2C_DATA_ADDRESS;
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.periph_memory_width = DMA_PERIPH_WIDTH_8BIT;
    dma_init_struct.number = 1U;
    dma_init_struct.priority = DMA_PRIORITY_ULTRA_HIGH;
    dma_single_data_mode_init(OLED_DMA_PERIPH, OLED_DMA_CH, &dma_init_struct);
    dma_circulation_disable(OLED_DMA_PERIPH, OLED_DMA_CH);
    dma_channel_subperipheral_select(OLED_DMA_PERIPH, OLED_DMA_CH, OLED_DMA_SUBPERI);

    nvic_irq_enable(OLED_DMA_IRQn, 2U, 0U);

    return OLED_OK;
}

static uint8_t oled_iic_deinit(void)
{
    oled_stop_i2c_dma();
    i2c_deinit(OLED_I2C_PERIPH);

    return OLED_OK;
}

static uint8_t oled_noop_init(void)
{
    return OLED_OK;
}

static uint8_t oled_noop_write(uint8_t value)
{
    (void)value;

    return OLED_OK;
}

static uint8_t oled_noop_spi_write(uint8_t *buf, uint16_t len)
{
    (void)buf;
    (void)len;

    return OLED_OK;
}

static void oled_delay_ms(uint32_t ms)
{
    delay_1ms(ms);
}

static void oled_debug_print(const char *const fmt, ...)
{
    va_list args;

    va_start(args, fmt);
    (void)vprintf(fmt, args);
    va_end(args);
}

static void oled_link_handle(void)
{
    DRIVER_SSD1306_LINK_INIT(&s_oled_handle, ssd1306_handle_t);
    DRIVER_SSD1306_LINK_IIC_INIT(&s_oled_handle, oled_iic_init);
    DRIVER_SSD1306_LINK_IIC_DEINIT(&s_oled_handle, oled_iic_deinit);
    DRIVER_SSD1306_LINK_IIC_WRITE(&s_oled_handle, oled_dma_write);
    DRIVER_SSD1306_LINK_SPI_INIT(&s_oled_handle, oled_noop_init);
    DRIVER_SSD1306_LINK_SPI_DEINIT(&s_oled_handle, oled_noop_init);
    DRIVER_SSD1306_LINK_SPI_WRITE_COMMAND(&s_oled_handle, oled_noop_spi_write);
    DRIVER_SSD1306_LINK_SPI_COMMAND_DATA_GPIO_INIT(&s_oled_handle, oled_noop_init);
    DRIVER_SSD1306_LINK_SPI_COMMAND_DATA_GPIO_DEINIT(&s_oled_handle, oled_noop_init);
    DRIVER_SSD1306_LINK_SPI_COMMAND_DATA_GPIO_WRITE(&s_oled_handle, oled_noop_write);
    DRIVER_SSD1306_LINK_RESET_GPIO_INIT(&s_oled_handle, oled_noop_init);
    DRIVER_SSD1306_LINK_RESET_GPIO_DEINIT(&s_oled_handle, oled_noop_init);
    DRIVER_SSD1306_LINK_RESET_GPIO_WRITE(&s_oled_handle, oled_noop_write);
    DRIVER_SSD1306_LINK_DELAY_MS(&s_oled_handle, oled_delay_ms);
    DRIVER_SSD1306_LINK_DEBUG_PRINT(&s_oled_handle, oled_debug_print);
}

static uint8_t oled_write_cmds(const uint8_t *cmds, uint8_t len)
{
    return ssd1306_write_cmd(&s_oled_handle, (uint8_t *)cmds, len);
}

static uint8_t oled_config_128x32(void)
{
    static const uint8_t init_cmds[] = {
        0xAEU,
        0xD5U, 0x80U,
        0xA8U, 0x1FU,
        0xD3U, 0x00U,
        0x40U,
        0x8DU, 0x14U,
        0x20U, 0x00U,
        0xA1U,
        0xC8U,
        0xDAU, 0x00U,
        0x81U, 0x80U,
        0xD9U, 0x1FU,
        0xDBU, 0x40U,
        0xA4U,
        0xA6U,
        0xAFU,
    };

    return oled_write_cmds(init_cmds, (uint8_t)sizeof(init_cmds));
}

