mlnn3014/GD32F470VE_OLED_Project/Bsp/Src/oled_bsp.c
static void oled_find_window(uint8_t mask, uint8_t *start_page, uint8_t *end_page)
{
    uint8_t page;

    *start_page = 0U;
    *end_page = 0U;

    for (page = 0U; page < OLED_PAGE_COUNT; page++) {
        if ((mask & (1U << page)) != 0U) {
            *start_page = page;
            *end_page = page;
            while (((*end_page + 1U) < OLED_PAGE_COUNT) &&
                   ((mask & (1U << (*end_page + 1U))) != 0U)) {
                (*end_page)++;
            }
            return;
        }
    }
}

static uint8_t oled_pages_to_mask(uint8_t start_page, uint8_t end_page)
{
    uint8_t mask = 0U;
    uint8_t page;

    for (page = start_page; page <= end_page; page++) {
        mask |= (uint8_t)(1U << page);
    }

    return mask;
}

static void oled_prepare_window_cmd(uint8_t start_page, uint8_t end_page)
{
    s_oled_cmd_buf[0] = 0x21U;
    s_oled_cmd_buf[1] = 0x00U;
    s_oled_cmd_buf[2] = (uint8_t)(OLED_WIDTH - 1U);
    s_oled_cmd_buf[3] = 0x22U;
    s_oled_cmd_buf[4] = start_page;
    s_oled_cmd_buf[5] = end_page;
}

static uint16_t oled_prepare_window_data(uint8_t start_page, uint8_t end_page)
{
    uint16_t len = 0U;
    uint8_t page;
    uint8_t x;

    for (page = start_page; page <= end_page; page++) {
        for (x = 0U; x < OLED_WIDTH; x++) {
            s_oled_cmd_buf[0] = s_oled_handle.gram[x][page];
            s_oled_tx_buf[1U + len] = s_oled_cmd_buf[0];
            len++;
        }
    }

    return len;
}

static uint8_t oled_start_window_cmd(uint8_t start_page, uint8_t end_page)
{
    s_tx_start_page = start_page;
    s_tx_end_page = end_page;
    s_tx_phase = OLED_TX_CMD;
    oled_prepare_window_cmd(start_page, end_page);

    return oled_dma_start(OLED_I2C_WRITE_ADDR, 0x00U, s_oled_cmd_buf, 6U, 1U);
}

static uint8_t oled_start_window_data(void)
{
    uint16_t len;

    len = oled_prepare_window_data(s_tx_start_page, s_tx_end_page);
    s_tx_phase = OLED_TX_DATA;

    return oled_dma_start(OLED_I2C_WRITE_ADDR, 0x40U, &s_oled_tx_buf[1], len, 1U);
}

static uint8_t oled_update_dirty_sync(void)
{
    uint8_t res;
    uint8_t start_page;
    uint8_t end_page;
    uint8_t pages;
    uint16_t len;

    if (s_oled_busy != 0U) {
        res = oled_wait_ready(OLED_ASYNC_TIMEOUT_MS);
        if (res != OLED_OK) {
            return res;
        }
    }

    s_oled_error = OLED_OK;
    while (s_dirty_pages != 0U) {
        oled_find_window(s_dirty_pages, &start_page, &end_page);
        pages = oled_pages_to_mask(start_page, end_page);
        s_dirty_pages &= (uint8_t)~pages;

        oled_prepare_window_cmd(start_page, end_page);
        res = oled_dma_write(OLED_I2C_WRITE_ADDR, 0x00U, s_oled_cmd_buf, 6U);
        if (res != OLED_OK) {
            s_dirty_pages |= pages;
            s_oled_error = res;
            return res;
        }

        len = oled_prepare_window_data(start_page, end_page);
        res = oled_dma_write(OLED_I2C_WRITE_ADDR, 0x40U, &s_oled_tx_buf[1], len);
        if (res != OLED_OK) {
            s_dirty_pages |= pages;
            s_oled_error = res;
            return res;
        }
    }

    s_active_pages = 0U;
    s_tx_phase = OLED_TX_IDLE;
    return OLED_OK;
}

static void oled_async_fail(uint8_t pages)
{
    oled_tx_finish();
    (void)oled_wait_i2c_stop_clear(OLED_I2C_PERIPH, OLED_I2C_WAIT_TIMEOUT / 10U);
    oled_i2c_bus_reset();
    s_dirty_pages |= pages;
    s_active_pages = 0U;
    s_tx_phase = OLED_TX_IDLE;
    s_oled_error = OLED_ERR;
    s_oled_busy = 0U;
}

static void oled_start_next_window_from_irq(void)
{
    uint8_t start_page;
    uint8_t end_page;
    uint8_t pages;

    if (s_active_pages == 0U) {
        s_tx_phase = OLED_TX_IDLE;
        s_oled_busy = 0U;
        return;
    }

    oled_find_window(s_active_pages, &start_page, &end_page);
    pages = oled_pages_to_mask(start_page, end_page);
    s_active_pages &= (uint8_t)~pages;

    if (oled_start_window_cmd(start_page, end_page) != OLED_OK) {
        oled_async_fail((uint8_t)(pages | s_active_pages));
    }
}

static void oled_draw_char_6x8(uint8_t x, uint8_t page, uint8_t ch, uint8_t color)
{
    uint8_t col;
    uint8_t chr = ch;

    if ((chr < ' ') || (chr > '~')) {
        chr = ' ';
    }
    chr = (uint8_t)(chr - ' ');

    for (col = 0U; col < 6U; col++) {
        if ((x + col) >= OLED_WIDTH) {
            return;
        }
        s_oled_handle.gram[x + col][page] = (color != 0U) ? F6X8[chr][col] : (uint8_t)~F6X8[chr][col];
    }
}

static void oled_draw_char_8x16(uint8_t x, uint8_t page, uint8_t ch, uint8_t color)
{
    uint8_t col;
    uint8_t chr = ch;

    if ((chr < ' ') || (chr > '~')) {
        chr = ' ';
    }
    chr = (uint8_t)(chr - ' ');

    for (col = 0U; col < 8U; col++) {
        if ((x + col) >= OLED_WIDTH) {
            return;
        }
        s_oled_handle.gram[x + col][page] = (color != 0U) ? F8X16[(chr * 16U) + col] : (uint8_t)~F8X16[(chr * 16U) + col];
        if ((page + 1U) < OLED_PAGE_COUNT) {
            s_oled_handle.gram[x + col][page + 1U] = (color != 0U) ? F8X16[(chr * 16U) + col + 8U] : (uint8_t)~F8X16[(chr * 16U) + col + 8U];
        }
    }
}

uint8_t oled_init(void)
{
    uint8_t res;

    oled_link_handle();
    res = ssd1306_set_interface(&s_oled_handle, SSD1306_INTERFACE_IIC);
    if (res != OLED_OK) {
        return OLED_ERR;
    }

    res = ssd1306_set_addr_pin(&s_oled_handle, SSD1306_ADDR_SA0_0);
    if (res != OLED_OK) {
        return OLED_ERR;
    }

    res = ssd1306_init(&s_oled_handle);
    if (res != OLED_OK) {
        return OLED_ERR;
    }

    res = oled_config_128x32();
    if (res != OLED_OK) {
        return OLED_ERR;
    }

    s_oled_inited = 1U;
    s_oled_busy = 0U;
    s_oled_error = OLED_OK;
    s_tx_phase = OLED_TX_IDLE;
    s_dirty_pages = 0U;
    (void)memset(s_oled_handle.gram, 0, sizeof(s_oled_handle.gram));
    oled_mark_all_dirty();

    return oled_update();
}

uint8_t oled_deinit(void)
{
    uint8_t res;

    if (s_oled_inited == 0U) {
        return OLED_OK;
    }

    (void)oled_wait_ready(OLED_ASYNC_TIMEOUT_MS);
    res = ssd1306_deinit(&s_oled_handle);
    s_oled_inited = 0U;
    s_dirty_pages = 0U;
    s_active_pages = 0U;
    s_oled_busy = 0U;
    s_tx_phase = OLED_TX_IDLE;

    return (res == 0U) ? OLED_OK : OLED_ERR;
}

uint8_t oled_clear(void)
{
    if (s_oled_inited == 0U) {
        return OLED_ERR;
    }

