mlnn3014/GD32F470VE_OLED_Project/Bsp/Src/oled_bsp.c
    (void)memset(s_oled_handle.gram, 0, sizeof(s_oled_handle.gram));
    oled_mark_all_dirty();

    return OLED_OK;
}

uint8_t oled_update_async(void)
{
    if (s_oled_inited == 0U) {
        return OLED_ERR;
    }
    if (s_dirty_pages == 0U) {
        return OLED_OK;
    }

    return oled_update_dirty_sync();
}

uint8_t oled_update(void)
{
    if (s_oled_inited == 0U) {
        return OLED_ERR;
    }

    return oled_update_dirty_sync();
}

uint8_t oled_is_busy(void)
{
    return s_oled_busy;
}

uint8_t oled_has_dirty(void)
{
    return (s_dirty_pages != 0U) ? 1U : 0U;
}

uint8_t oled_wait_ready(uint32_t timeout_ms)
{
    uint32_t start = systick_get_ms();

    while (s_oled_busy != 0U) {
        if ((uint32_t)(systick_get_ms() - start) >= timeout_ms) {
            oled_async_fail((uint8_t)(s_active_pages | oled_pages_to_mask(s_tx_start_page, s_tx_end_page)));
            return OLED_TIMEOUT;
        }
    }

    return (s_oled_error == OLED_OK) ? OLED_OK : OLED_ERR;
}

uint8_t oled_display_on(void)
{
    uint8_t res;

    if (s_oled_inited == 0U) {
        return OLED_ERR;
    }
    res = oled_wait_ready(OLED_ASYNC_TIMEOUT_MS);
    if (res != OLED_OK) {
        return res;
    }

    return (ssd1306_set_display(&s_oled_handle, SSD1306_DISPLAY_ON) == 0U) ? OLED_OK : OLED_ERR;
}

uint8_t oled_display_off(void)
{
    uint8_t res;

    if (s_oled_inited == 0U) {
        return OLED_ERR;
    }
    res = oled_wait_ready(OLED_ASYNC_TIMEOUT_MS);
    if (res != OLED_OK) {
        return res;
    }

    return (ssd1306_set_display(&s_oled_handle, SSD1306_DISPLAY_OFF) == 0U) ? OLED_OK : OLED_ERR;
}

uint8_t oled_draw_point(uint8_t x, uint8_t y, uint8_t color)
{
    uint8_t page;
    uint8_t bit;

    if ((s_oled_inited == 0U) || (x >= OLED_WIDTH) || (y >= OLED_HEIGHT)) {
        return OLED_ERR;
    }

    page = (uint8_t)(y / 8U);
    bit = (uint8_t)(1U << (y % 8U));
    if (color != 0U) {
        s_oled_handle.gram[x][page] |= bit;
    } else {
        s_oled_handle.gram[x][page] &= (uint8_t)~bit;
    }
    oled_mark_pages(y, y);

    return OLED_OK;
}

uint8_t oled_fill_rect(uint8_t left, uint8_t top, uint8_t right, uint8_t bottom, uint8_t color)
{
    uint8_t x;
    uint8_t y;

    if ((s_oled_inited == 0U) || (left >= OLED_WIDTH) || (top >= OLED_HEIGHT) || (left > right) || (top > bottom)) {
        return OLED_ERR;
    }
    if (right >= OLED_WIDTH) {
        right = OLED_WIDTH - 1U;
    }
    if (bottom >= OLED_HEIGHT) {
        bottom = OLED_HEIGHT - 1U;
    }

    for (y = top; y <= bottom; y++) {
        for (x = left; x <= right; x++) {
            (void)oled_draw_point(x, y, color);
        }
    }
    oled_mark_pages(top, bottom);

    return OLED_OK;
}

uint8_t oled_show_string(uint8_t x, uint8_t y, const char *str, uint8_t font, uint8_t color)
{
    uint8_t page;
    uint8_t char_w;
    uint8_t char_h;
    uint8_t cur_x;
    uint8_t end_y;
    uint8_t any = 0U;

    if ((s_oled_inited == 0U) || (str == NULL) || (x >= OLED_WIDTH) || (y >= OLED_HEIGHT)) {
        return OLED_ERR;
    }
    if ((y % 8U) != 0U) {
        return OLED_ERR;
    }

    if (font == OLED_FONT_8) {
        char_w = 6U;
        char_h = 8U;
    } else if (font == OLED_FONT_16) {
        char_w = 8U;
        char_h = 16U;
    } else {
        return OLED_ERR;
    }

    if ((y + char_h) > OLED_HEIGHT) {
        return OLED_ERR;
    }

    page = (uint8_t)(y / 8U);
    cur_x = x;
    while (*str != '\0') {
        if ((cur_x + char_w) > OLED_WIDTH) {
            break;
        }

        if (font == OLED_FONT_8) {
            oled_draw_char_6x8(cur_x, page, (uint8_t)*str, color);
        } else {
            oled_draw_char_8x16(cur_x, page, (uint8_t)*str, color);
        }
        cur_x = (uint8_t)(cur_x + char_w);
        str++;
        any = 1U;
    }

    if (any == 0U) {
        return OLED_ERR;
    }

    end_y = (uint8_t)(y + char_h - 1U);
    oled_mark_pages(y, end_y);

    return OLED_OK;
}

int oled_printf(uint8_t x, uint8_t y, const char *format, ...)
{
    char buffer[128];
    va_list arg;
    int len;

    va_start(arg, format);
    len = vsnprintf(buffer, sizeof(buffer), format, arg);
    va_end(arg);

    if (len < 0) {
        return len;
    }

    if (oled_show_string(x, y, buffer, OLED_FONT_8, 1U) != OLED_OK) {
        return -1;
    }

    return len;
}

void oled_dma_irq_handler(void)
{
    uint8_t pages;

    if (s_oled_busy == 0U) {
        oled_dma_int_clear_all();
        return;
    }

    if ((SET == dma_interrupt_flag_get(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_FLAG_TAE)) ||
        (SET == dma_interrupt_flag_get(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_FLAG_SDE)) ||
        (SET == dma_interrupt_flag_get(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_FLAG_FEE))) {
        pages = (uint8_t)(s_active_pages | oled_pages_to_mask(s_tx_start_page, s_tx_end_page));
        dma_interrupt_flag_clear(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_FLAG_TAE);
        dma_interrupt_flag_clear(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_FLAG_SDE);
        dma_interrupt_flag_clear(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_FLAG_FEE);
        oled_async_fail(pages);
        return;
    }

    if (SET == dma_interrupt_flag_get(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_FLAG_FTF)) {
        dma_interrupt_flag_clear(OLED_DMA_PERIPH, OLED_DMA_CH, DMA_INT_FLAG_FTF);

        if (oled_tx_finish_blocking() != OLED_OK) {
            pages = (uint8_t)(s_active_pages | oled_pages_to_mask(s_tx_start_page, s_tx_end_page));
            oled_async_fail(pages);
            return;
        }

        if (s_tx_phase == OLED_TX_CMD) {
            if (oled_start_window_data() != OLED_OK) {
                pages = (uint8_t)(s_active_pages | oled_pages_to_mask(s_tx_start_page, s_tx_end_page));
                oled_async_fail(pages);
            }
        } else {
            s_tx_phase = OLED_TX_IDLE;
            oled_start_next_window_from_irq();
        }
    }
}
